app/Http/Controllers/UsulanController.php

    public function index()
    {
        $dt =  Carbon::now()->setTimezone('Asia/Jakarta');
        return view('dashboard/dashboard', [
            'collection' => Usulan::all(),
            'usulan_total' => Usulan::count(),
            'usulan_weekly' => Usulan::whereBetween("Tgl_Usul", [
                $dt->startOfWeek()->format('Y-m-d'),
                $dt->endOfWeek()->format('Y-m-d')
            ])->count(),
            'usulan_monthly' => Usulan::whereBetween("Tgl_Usul", [
                $dt->startOfMonth()->format('Y-m-d'),
                $dt->endOfMonth()->format('Y-m-d')
            ])->count(),
            'desas' => DB::table('Usulans')
                ->select('Desa AS nama', DB::raw('count(*) as total'))
                ->groupBy('Desa')
                ->get(),
            'kecamatans' => DB::table('Usulans')
                ->select('Kecamatan AS nama', DB::raw('count(*) as total'))
                ->groupBy('Kecamatan')
                ->get(),
            'dinas' => DB::table('Usulans')
                ->select('SKPD_Tujuan_Akhir AS nama', DB::raw('count(*) as total'))
                ->groupBy('SKPD_Tujuan_Akhir')
                ->get(),
            'tipe_usulan' => DB::table('Usulans')
                ->select('TipeUsulan AS nama', DB::raw('count(*) as total'))
                ->groupBy('TipeUsulan')
                ->get()
---
SELECT count(*) as aggregate FROM `usulans`
SELECT count(*) as aggregate FROM `usulans` WHERE `Tgl_Usul` between '2023-01-09' and '2023-01-15'
SELECT `Desa` as `nama`, count(*) as total FROM `usulans` GROUP BY `Desa`
SELECT `Kecamatan` as `nama`, count(*) as total FROM `usulans` GROUP BY `Kecamatan`
SELECT `SKPD_Tujuan_Akhir` as `nama`, count(*) as total FROM `usulans` GROUP BY `SKPD_Tujuan_Akhir`

    public function usulan()
    {
        return view('dashboard/usulan', [
            'collection' => Usulan::all(),
            'desas' => Desa::all(),
            'kecamatans' => Kecamatan::all()
        ]);
---
SELECT * FROM `kecamatans`
SELECT * FROM `desas`
SELECT * FROM `usulans`