app/Http/Controllers/UsulanController.php

    public function usulan()
    {
        $dt =  Carbon::now()->setTimezone('Asia/Jakarta');
        return view('dashboard/usulan', [
            'collection' => Usulan::whereBetween("Tgl_Usul", [
                $dt->startOfWeek()->format('Y-m-d'),
                $dt->endOfWeek()->format('Y-m-d')
            ])
            ->orWhere('Status', 'NOT LIKE',"%Usulan disetujui%")
            ->get(),
            'desas' => Desa::all(),
            'kecamatans' => Kecamatan::all()
        ]);
---
SELECT * FROM `usulans` WHERE `Tgl_Usul` between '2023-01-09' and '2023-01-15' or `Status` LIKE 'TIDAK SETUJU'
SELECT * FROM `desas`
SELECT * FROM `kecamatans`